[{
  "_id": {
    "$oid": "67644750d4a16fc6bdfb75a8"
  },
  "qid": "Q001",
  "testimonial_type": "personality_test",
  "testimonial": "This report has been life-changing for me. It feels like a guiding light during my darkest moments, illuminating the path to success and happiness.",
  "country": "Malaysia"
},
{
  "_id": {
    "$oid": "67644750d4a16fc6bdfb75a9"
  },
  "qid": "Q002",
  "testimonial_type": "personality_test",
  "testimonial": "I'm truly impressed by the accuracy and depth of this report. It's like having a personal coach who understands you completely.",
  "country": "Dubai, UAE"
},
{
  "_id": {
    "$oid": "67644750d4a16fc6bdfb75aa"
  },
  "qid": "Q003",
  "testimonial_type": "personality_test",
  "testimonial": "This report offered me a new outlook on life. It's like a refreshing breeze, inspiring me to pursue my goals with renewed energy and excitement.",
  "country": "Hong Kong"
},
{
  "_id": {
    "$oid": "67644750d4a16fc6bdfb75ab"
  },
  "qid": "Q004",
  "testimonial_type": "personality_test",
  "testimonial": "I've shared this report with all my colleagues. It has given me valuable insights into my strengths and weaknesses at work, paving the way for career advancement.",
  "country": "South Africa"
},
{
  "_id": {
    "$oid": "67644750d4a16fc6bdfb75ac"
  },
  "qid": "Q005",
  "testimonial_type": "personality_test",
  "testimonial": "I'm absolutely thrilled with the results of this report. It's been a guiding light, enabling me to make wiser decisions and tackle life's challenges.",
  "country": "Jordan"
},
{
  "_id": {
    "$oid": "67644750d4a16fc6bdfb75ad"
  },
  "qid": "Q006",
  "testimonial_type": "personality_test",
  "testimonial": "I'm delighted by the insights this report has provided. It has empowered me with the confidence to chase my dreams and achieve success in my career.",
  "country": "USA"
},
{
  "_id": {
    "$oid": "67644750d4a16fc6bdfb75ae"
  },
  "qid": "Q007",
  "testimonial_type": "personality_test",
  "testimonial": "This report revealed opportunities I hadn’t realized before. It’s an essential resource for anyone striving for personal and professional growth.",
  "country": "India"
},
{
  "_id": {
    "$oid": "67644750d4a16fc6bdfb75af"
  },
  "qid": "Q008",
  "testimonial_type": "personality_test",
  "testimonial": "I never imagined a report could have such a profound impact on my life, but this one truly has. It feels like carrying a mentor with you at all times. Thank you!",
  "country": "Egypt"
},
{
  "_id": {
    "$oid": "67644750d4a16fc6bdfb75b0"
  },
  "qid": "Q009",
  "testimonial_type": "personality_test",
  "testimonial": "This report is truly invaluable. It’s like having a personal coach guiding you every step of the way. It has completely changed how I approach life, and I couldn’t be more pleased with the results.",
  "country": "Mauritius"
},
{
  "_id": {
    "$oid": "67644750d4a16fc6bdfb75b1"
  },
  "qid": "Q010",
  "testimonial_type": "personality_test",
  "testimonial": "The report felt like a mirror, offering profound reflections on my life. It provided valuable insights into my identity and future direction. With this newfound clarity, I’m making more confident and informed decisions, and the positive impact on my life has been remarkable.",
  "country": "Malaysia"
},
{
  "_id": {
    "$oid": "67644750d4a16fc6bdfb75b2"
  },
  "qid": "Q011",
  "testimonial_type": "personality_test",
  "testimonial": "This report provided me with insights that have greatly enhanced my confidence and sharpened my decision-making skills. It’s an invaluable resource for anyone striving to live their best life.",
  "country": "Malaysia"
},
{
  "_id": {
    "$oid": "67644750d4a16fc6bdfb75b3"
  },
  "qid": "Q012",
  "testimonial_type": "personality_test",
  "testimonial": "Always driven by a desire for personal growth, I found this report to be truly eye-opening. It’s empowered me to unlock my full potential and embrace life to the fullest.",
  "country": "Malaysia"
},
{
  "_id": {
    "$oid": "67644750d4a16fc6bdfb75b4"
  },
  "qid": "Q013",
  "testimonial_type": "personality_test",
  "testimonial": "The report unlocked the mysteries of my life, serving as a treasure trove of self-discovery. I've eagerly shared it with all my friends and family.",
  "country": "USA"
},
{
  "_id": {
    "$oid": "67644750d4a16fc6bdfb75b5"
  },
  "qid": "Q014",
  "testimonial_type": "personality_test",
  "testimonial": "I've explored many self-help tools, but this report stands apart. It's not only insightful but also incredibly empowering. I only wish I had discovered it sooner!",
  "country": "India"
},
{
  "_id": {
    "$oid": "67644750d4a16fc6bdfb75b6"
  },
  "qid": "Q015",
  "testimonial_type": "personality_test",
  "testimonial": "I’m beyond grateful for this report. It’s provided me with the clarity and direction I’ve been seeking, setting my life on an entirely new and exciting path!",
  "country": "Canada"
},
{
  "_id": {
    "$oid": "67644750d4a16fc6bdfb75b7"
  },
  "qid": "Q016",
  "testimonial_type": "personality_test",
  "testimonial": "This report has transformed my life. It revealed the reasons behind the patterns that were holding me back and showed me how to overcome them. I feel more confident and happier than ever before.",
  "country": "South Africa"
},
{
  "_id": {
    "$oid": "67644750d4a16fc6bdfb75b8"
  },
  "qid": "Q017",
  "testimonial_type": "personality_test",
  "testimonial": "The report offered me a clear roadmap for navigating both my career and personal relationships. It feels like a secret advantage in life. I can’t recommend it enough!",
  "country": "Australia"
},
{
  "_id": {
    "$oid": "67644750d4a16fc6bdfb75b9"
  },
  "qid": "Q018",
  "testimonial_type": "personality_test",
  "testimonial": "The report acted like a mirror, reflecting my life with remarkable clarity. It offered deep insights into who I am and where I’m going. With this understanding, I’m making smarter decisions, and the impact on my life has been transformative.",
  "country": "United Kingdom"
}]